app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "dfdasfs"], ["created_at", "2014-05-10 03:22:22.377651"], ["updated_at", "2014-05-10 03:22:22.377651"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @status.update(status_params)
---
UPDATE "statuses" SET "content" = ?, "updated_at" = ? WHERE "statuses"."id" = 11  [["content", "I am here again!"], ["updated_at", "2014-05-12 04:14:26.497888"]]

  def destroy
    @status.destroy
---
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]

    def set_status
      @status = Status.find(params[:id])
---
SELECT  "statuses".* FROM "statuses"  WHERE "statuses"."id" = ? LIMIT 1  [["id", 2]]

    def set_user
      @status.user = User.find_by(@status.user_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 5  ORDER BY "users"."id" ASC LIMIT 1